def area(a, b):
    """
    Вычисляет площадь прямоугольника по двум сторонам.

    Параметры:
        a (float | int): Длина первой стороны прямоугольника.
        b (float | int): Длина второй стороны прямоугольника.

    Возвращаемое значение:
        float | int: Площадь прямоугольника.

    Пример вызова:
        >>> area(3, 5)
        15
    """
    return a * b


def perimeter(a, b):
    """
    Вычисляет периметр прямоугольника по двум сторонам.

    Параметры:
        a (float | int): Длина первой стороны прямоугольника.
        b (float | int): Длина второй стороны прямоугольника.

    Возвращаемое значение:
        float | int: Периметр прямоугольника.

    Пример вызова:
        >>> perimeter(3, 5)
        16
    """
    return 2 * (a + b)
