def area(a):
    """
    Вычисляет площадь квадрата по длине его стороны.

    Параметры:
        a (float | int): Длина стороны квадрата.

    Возвращаемое значение:
        float | int: Площадь квадрата.

    Пример вызова:
        >>> area(4)
        16
    """
    return a * a


def perimeter(a):
    """
    Вычисляет периметр квадрата по длине его стороны.

    Параметры:
        a (float | int): Длина стороны квадрата.

    Возвращаемое значение:
        float | int: Периметр квадрата.

    Пример вызова:
        >>> perimeter(4)
        16
    """
    return 4 * a
